data/DUCT/AR_10_Ret_180/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.02;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    "(wallTop|wallSide)"
    {
        type            fixedValue;
        value           uniform 0.;
    }
    
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    
    "(symmetryBottom|symmetrySide)"
    {
        type            symmetry;
    }

}

// ************************************************************************* //
