data/DUCT/AR_10_Ret_180/0/k_LES
k_LES nonuniform List<scalar>
22090
(
4.8790126375375005
5.343432825062245
6.1038786945347105
7.01256093764279
7.97468085862472
8.955306725439819
9.955025938111145
10.957729627536576
...
);
