data/DUCT/AR_10_Ret_180/0/tauij_LES
tauij_LES nonuniform List<symmTensor>
22090
(
(4.5300044748944615 0.2886214149398984 -0.001534208443575682 2.5709620233418478 -0.0005251059312833906 2.6570587864291375)
(5.144333238887915 0.8382656954027722 -6.491919822347479e-06 2.669965122833271 -0.0010568412200795264 2.872567283405348)
(6.121271364098202 1.3398507038640963 -0.00029089429985640065 2.843936328451361 -0.000604143786882984 3.242549681787424)
(7.24587052915354 1.8003928549524637 -0.0005680504624818338 3.0701054120523374 0.0004110744217816352 3.7091459098393518)
(8.409589606176011 2.2167561329948544 0.0017975820556807025 3.3243453026058583 0.0010854749124613473 4.215426778529073)
(9.590844359494621 2.5940665471830195 0.003276025148718068 3.5883750461484967 0.0008498790070205965 4.7313940029813475)
(10.812648199043117 2.941215865093955 0.0024496704555118146 3.8497469104115734 -0.000419824862767801 5.247656726006023)
(12.078290230901638 3.25975795787372 0.0011678702037747194 4.094154506144189 -0.002916142621133582 5.743014481734719)
...
);
