data/DUCT/AR_10_Ret_180/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
22090
(
(0.0005 4.597582821e-05 4.710483638e-05)
(0.0005 0.0001337478639 4.710483638e-05)
(0.0005 0.0002135406236 4.710483638e-05)
(0.0005 0.0002860794961 4.710483638e-05)
(0.0005 0.0003520239255 4.710483638e-05)
(0.0005 0.0004119734069 4.710483638e-05)
(0.0005 0.0004664729355 4.710483638e-05)
(0.0005 0.0005160179614 4.710483638e-05)
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<vector> 
470
(
(0.0005 0.001 4.710483638e-05)
(0.0005 0.001 0.0001408762193)
(0.0005 0.001 0.0002337751005)
(0.0005 0.001 0.0003258095983)
(0.0005 0.001 0.0004169877554)
(0.0005 0.001 0.0005073175397)
(0.0005 0.001 0.0005968068449)
(0.0005 0.001 0.0006854634913)
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<vector> 
47
(
(0.0005 4.597582821e-05 0.01)
(0.0005 0.0001337478639 0.01)
(0.0005 0.0002135406236 0.01)
(0.0005 0.0002860794961 0.01)
(0.0005 0.0003520239255 0.01)
(0.0005 0.0004119734069 0.01)
(0.0005 0.0004664729355 0.01)
(0.0005 0.0005160179614 0.01)
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
