data/DUCT/AR_10_Ret_180/constant/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
22090
(
4.710483638e-05
4.710483638e-05
4.710483638e-05
4.710483638e-05
4.710483638e-05
4.710483638e-05
4.710483638e-05
4.710483638e-05
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<scalar> 
470
(
4.710483638e-05
0.0001408762193
0.0002337751005
0.0003258095983
0.0004169877554
0.0005073175397
0.0005968068449
0.0006854634913
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<scalar> 
47
(
0.01
0.01
0.01
0.01
0.01
0.01
0.01
0.01
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
