data/DUCT/AR_10_Ret_180/constant/V
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
22090
(
8.662735461e-12
7.875214051e-12
7.159285507e-12
6.508441374e-12
5.916764873e-12
5.378877167e-12
4.889888333e-12
4.44535303e-12
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           uniform 0;
    }
    wallSide
    {
        type            calculated;
        value           uniform 0;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
