data/DUCT/AR_10_Ret_180/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inflow
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          22090;
        startFace       43663;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outflow;
    }
    outflow
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          22090;
        startFace       65753;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inflow;
    }
    wallTop
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          470;
        startFace       87843;
    }
    wallSide
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          47;
        startFace       88313;
    }
    symmetryBottom
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          470;
        startFace       88360;
    }
    symmetrySide
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          47;
        startFace       88830;
    }
)

// ************************************************************************* //
