data/DUCT/AR_10_Ret_180/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }
    
    omega
    {
        $U;
        tolerance       1e-15; //Needed to get sufficient convergence far from the wall
    }


}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        k               5e-6;
        omega           1e-10;
    }
    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }

    equations
    {
        U               0.9;
        "(k|omega)"     0.8;
    }
}


// ************************************************************************* //
